import tn from "./tn.png";
import { commonConfigRate } from "../../../common/utils";

export default {
    name: "cangguziyouzhishi",
    chs: "苍古自由之誓",
    url: tn,
    star: 5,
    type: "sword",
    config: () => commonConfigRate("苍古自由之誓"),
    effect: "飘游风中的「千年的大乐章」的一部分。伤害提升10%/12.5%/15%/17.5%/20%；触发元素反应时，角色获得一枚奋起之符，每0.5秒内至多触发一次，角色处于队伍后台也能触发。拥有2枚奋起之符时，将消耗所有奋起之符，使附近队伍中所有角色获得持续12秒的「千年的大乐章·抗争之歌」效果：普通攻击、重击、下落攻击造成的伤害提升16%/20%/24%/28%/32%，攻击力提升20%/25%/30%/35%/40%。触发后20秒内，无法再次获得奋起之符。「千年的大乐章」触发的多种数值效果中，同类数值效果不可叠加。",
}