import tn from "./tn.png";
import { commonConfigRate } from "../../../common/utils";

export default {
    name: "songlaixiangqizhishi",
    chs: "松籁响起之时",
    url: tn,
    star: 5,
    type: "sword2",
    config: () => commonConfigRate("松籁响起之时"),
    effect: "揭旗的叛逆之歌：飘游风中的「千年的大乐章」的一部分。攻击力提升16%/20%/24%/28%/32%（精炼数据为推测，以正式上线数据为准）；普通攻击或重击命中敌人时，角色获得一枚低语之符，每0.3秒内至多触发一次。拥有4枚低语之符时，将消耗所有低语之符，使附近队伍中所有角色获得持续12秒的「千年的大乐章·揭旗之歌」效果：普通攻击速度提升12%/15%/18%/21%/24%，攻击力提升20%/25%/30%/35%/40%（精炼数据为推测，以正式上线数据为准）。触发后20秒内，无法再次获得低语之符。「千年的大乐章」触发的多种数值效果中，同类数值效果不可叠加。"
}