export default {
    "thunderSmoother": {
        "setName": "平息鸣雷的尊者",
        "items": [
            "平雷之心",
            "平雷之羽",
            "平雷之刻",
            "平雷之器",
            "平雷之冠"
        ],
        "effects": {
            "2": "雷元素抗性提高40%。",
            "4": "对处于雷元素影响下的敌人造成的伤害提升35%。"
        }
    },
    "adventurer": {
        "setName": "冒险家",
        "items": [
            "冒险家之花",
            "冒险家尾羽",
            "冒险家怀表",
            "冒险家金杯",
            "冒险家头带"
        ],
        "effects": {
            "2": "生命值上限提高1000点。",
            "4": "开启各类宝箱后的5秒内，持续恢复30%生命值。"
        }
    },
    "retracingBolide": {
        "setName": "逆飞的流星",
        "items": [
            "夏祭之花",
            "夏祭终末",
            "夏祭之刻",
            "夏祭水玉",
            "夏祭之面"
        ],
        "effects": {
            "4": "处于护盾庇护下时，额外获得40%普通攻击和重击伤害加成。",
            "2": "护盾强效提高35%。"
        }
    },
    "berserker": {
        "setName": "战狂",
        "items": [
            "战狂的蔷薇",
            "战狂的翎羽",
            "战狂的时计",
            "战狂的骨杯",
            "战狂的鬼面"
        ],
        "effects": {
            "4": "生命值低于70%时，暴击率额外提升24%。",
            "2": "暴击率提高12%。"
        }
    },
    "emblemOfSeveredFate": {
        "setName": "绝缘之旗印",
        "items": [
            "明威之镡",
            "切落之羽",
            "雷云之笼",
            "绯花之壶",
            "华饰之兜"
        ],
        "effects": {
            "2": "元素充能效率提高20%。",
            "4": "基于元素充能效率的25%，提高元素爆发造成的伤害。至多通过这种方式获得75%提升。"
        }
    },
    "blizzardStrayer": {
        "setName": "冰风迷途的勇士",
        "items": [
            "历经风雪的思念",
            "摧冰而行的执望",
            "冰雪故园的终期",
            "遍结寒霜的傲骨",
            "破冰踏雪的回音"
        ],
        "effects": {
            "4": "攻击处于冰元素影响下的敌人时，暴击率提高20%；若敌人处于冻结状态下，则暴击率额外提高20%。",
            "2": "获得15%冰元素伤害加成。"
        }
    },
    "gambler": {
        "setName": "赌徒",
        "items": [
            "赌徒的胸花",
            "赌徒的羽饰",
            "赌徒的怀表",
            "赌徒的骰盅",
            "赌徒的耳环"
        ],
        "effects": {
            "4": "击败敌人时，有100%概率清除元素战技的冷却时间。该效果每15秒至多触发一次。",
            "2": "元素战技造成的伤害提升20%。"
        }
    },
    "huskOfOpulentDreams": {
        "setName": "华馆梦醒形骸记",
        "items": [
            "荣花之期",
            "华馆之羽",
            "众生之谣",
            "梦醒之瓢",
            "形骸之笠"
        ],
        "effects": {
            "2": "防御力提高30%。",
            "4": "装备此圣遗物套装的角色在以下情况下，将获得「问答」效果：在场上用岩元素攻击命中敌人后获得一层，每0.3秒至多触发一次；在队伍后台中，每3秒获得一层。问答至多叠加4层，每层能提供6%防御力与6%岩元素伤害加成。每6秒，若未获得问答效果，将损失一层。"
        }
    },
    "bloodstainedChivalry": {
        "setName": "染血的骑士道",
        "items": [
            "染血的铁之心",
            "染血的黑之羽",
            "骑士染血之时",
            "染血骑士之杯",
            "染血的铁假面"
        ],
        "effects": {
            "2": "造成的物理伤害提高25%。",
            "4": "击败敌人后的10秒内，施放重击时不消耗体力，且重击造成的伤害提升50%。"
        }
    },
    "defenderWill": {
        "setName": "守护之心",
        "items": [
            "守护之花",
            "守护徽印",
            "守护座钟",
            "守护之皿",
            "守护束带"
        ],
        "effects": {
            "2": "防御力提高30%。",
            "4": "队伍里每有不同一种元素类型的自己的角色，自身获得30%相应的元素抗性。"
        }
    },
    "prayersForIllumination": {
        "setName": "祭火之人",
        "items": [
            "祭火礼冠"
        ],
        "effects": {
            "1": "受到的火元素附着效果的持续时间减少40%。"
        }
    },
    "travelingDoctor": {
        "setName": "游医",
        "items": [
            "游医的银莲",
            "游医的枭羽",
            "游医的怀钟",
            "游医的药壶",
            "游医的方巾"
        ],
        "effects": {
            "2": "角色受到的治疗效果提高20%。",
            "4": "施放元素爆发时，恢复20%生命值。"
        }
    },
    "wandererTroupe": {
        "setName": "流浪大地的乐团",
        "items": [
            "乐团的晨光",
            "琴师的箭羽",
            "终幕的时计",
            "吟游者之壶",
            "指挥的礼帽"
        ],
        "effects": {
            "2": "元素精通提高80点。",
            "4": "装备该圣遗物套装的角色为法器、弓箭角色时，角色重击造成的伤害提高35%。"
        }
    },
    "resolutionOfSojourner": {
        "setName": "行者之心",
        "items": [
            "故人之心",
            "归乡之羽",
            "逐光之石",
            "异国之盏",
            "感别之冠"
        ],
        "effects": {
            "4": "重击的暴击率提升30%。",
            "2": "攻击力提高18%。"
        }
    },
    "archaicPetra": {
        "setName": "悠古的磐岩",
        "items": [
            "磐陀裂生之花",
            "嵯峨群峰之翼",
            "星罗圭璧之晷",
            "巉岩琢塑之樽",
            "不动玄石之相"
        ],
        "effects": {
            "2": "获得15%岩元素伤害加成。",
            "4": "获得结晶反应形成的晶片时，队伍中所有角色获得35%对应元素伤害加成，持续10秒。同时只能通过该效果获得一种元素伤害加成。"
        }
    },
    "heartOfDepth": {
        "setName": "沉沦之心",
        "items": [
            "饰金胸花",
            "追忆之风",
            "坚铜罗盘",
            "沉波之盏",
            "酒渍船帽"
        ],
        "effects": {
            "4": "施放元素战技后的15秒内，普通攻击与重击造成的伤害提高30%。",
            "2": "获得15%水元素伤害加成。"
        }
    },
    "instructor": {
        "setName": "教官",
        "items": [
            "教官的胸花",
            "教官的羽饰",
            "教官的怀表",
            "教官的茶杯",
            "教官的帽子"
        ],
        "effects": {
            "4": "触发元素反应后，队伍中所有角色的元素精通提高120点，持续8秒。",
            "2": "元素精通提高80点。"
        }
    },
    "gladiatorFinale": {
        "setName": "角斗士的终幕礼",
        "items": [
            "角斗士的留恋",
            "角斗士的归宿",
            "角斗士的希冀",
            "角斗士的酣醉",
            "角斗士的凯旋"
        ],
        "effects": {
            "4": "装备该圣遗物套装的角色为单手剑、双手剑、长柄武器角色时，角色普通攻击造成的伤害提高35%。",
            "2": "攻击力提高18%。"
        }
    },
    "lavaWalker": {
        "setName": "渡过烈火的贤人",
        "items": [
            "渡火者的决绝",
            "渡火者的解脱",
            "渡火者的煎熬",
            "渡火者的醒悟",
            "渡火者的智慧"
        ],
        "effects": {
            "2": "火元素抗性提高40%。",
            "4": "对处于火元素影响下的敌人造成的伤害提升35%。"
        }
    },
    "paleFlame": {
        "setName": "苍白之火",
        "items": [
            "无垢之花",
            "贤医之羽",
            "停摆之刻",
            "超越之盏",
            "嗤笑之面"
        ],
        "effects": {
            "4": "元素战技命中敌人后，攻击力提升9%。该效果持续7秒，至多叠加2层，每0.3秒至多触发一次。叠满2层时，2件套的效果提升100%。",
            "2": "造成的物理伤害提高25%。"
        }
    },
    "scholar": {
        "setName": "学士",
        "items": [
            "学士的书签",
            "学士的羽笔",
            "学士的时钟",
            "学士的墨杯",
            "学士的镜片"
        ],
        "effects": {
            "2": "元素充能效率提高20%。",
            "4": "获得元素微粒或元素晶球时，队伍中所有弓箭和法器角色额外恢复3点元素能量。该效果每3秒只能触发一次。"
        }
    },
    "braveHeart": {
        "setName": "勇士之心",
        "items": [
            "勇士的勋章",
            "勇士的期许",
            "勇士的坚毅",
            "勇士的壮行",
            "勇士的冠冕"
        ],
        "effects": {
            "2": "攻击力提高18%。",
            "4": "对生命值高于50%的敌人，造成的伤害增加30%。"
        }
    },
    "prayersToSpringtime": {
        "setName": "祭冰之人",
        "items": [
            "祭冰礼冠"
        ],
        "effects": {
            "1": "受到的冰元素附着效果的持续时间减少40%。"
        }
    },
    "oceanHuedClam": {
        "setName": "海染砗磲",
        "items": [
            "海染之花",
            "渊宫之羽",
            "离别之贝",
            "真珠之笼",
            "海祇之冠"
        ],
        "effects": {
            "2": "治疗加成提高15%。",
            "4": "装备此圣遗物套装的角色对队伍中的角色进行治疗时，将产生持续3秒的海染泡沫，记录治疗的生命值回复量（包括溢出值）。持续时间结束时，海染泡沫将会爆炸，对周围的敌人造成90%累计回复量的伤害（该伤害结算方式同感电、超导等元素反应，但不受元素精通、等级或反应伤害加成效果影响）。每3.5秒至多产生一个海染泡沫；海染泡沫至多记录30000点回复量，含溢出部分的治疗量；自己的队伍中同时至多存在一个海染泡沫。装备此圣遗物套装的角色处于队伍后台时，依然能触发该效果。"
        }
    },
    "shimenawaReminiscence": {
        "setName": "追忆之注连",
        "items": [
            "羁缠之花",
            "思忆之矢",
            "朝露之时",
            "祈望之心",
            "无常之面"
        ],
        "effects": {
            "2": "攻击力提高18%。",
            "4": "施放元素战技时，如果角色的元素能量高于或等于15点，则会流失15点元素能量，使接下来的10秒内，普通攻击、重击、下落攻击造成的伤害提高50%，持续期间内该效果不会再次触发。"
        }
    },
    "tenacityOfTheMillelith": {
        "setName": "千岩牢固",
        "items": [
            "勋绩之花",
            "昭武翎羽",
            "金铜时晷",
            "盟誓金爵",
            "将帅兜鍪"
        ],
        "effects": {
            "4": "元素战技命中敌人后，使队伍中附近的所有角色攻击力提升20%，护盾强效提升30%，持续3秒。该效果每0.5秒至多触发一次。装备此圣遗物套装的角色处于队伍后台时，依然能触发该效果。",
            "2": "生命值提升20%"
        }
    },
    "Empty": {
        "setName": "赌徒",
        "items": [
            "赌徒的胸花",
            "赌徒的羽饰",
            "赌徒的怀表",
            "赌徒的骰盅",
            "赌徒的耳环"
        ],
        "effects": {
            "4": "击败敌人时，有100%概率清除元素战技的冷却时间。该效果每15秒至多触发一次。",
            "2": "元素战技造成的伤害提升20%。"
        }
    },
    "VermillionHereafter": {
        "setName": "辰砂往生录",
        "items": [
            "生灵之华",
            "潜光片羽",
            "阳辔之遗",
            "结契之刻",
            "虺雷之姿"
        ],
        "effects": {
            "2": "攻击力提高18%。",
            "4": "施放元素爆发后，将产生持续16秒的「潜光」效果：攻击力提升8%；并在角色的生命值降低时，攻击力进一步提升10%，至多通过这种方式提升4次，每0.8秒至多触发一次。「潜光」效果将在角色退场时消失；持续期间再次施放元素爆发，将移除原有的「潜光」。"
        }
    },
    "maidenBeloved": {
        "setName": "被怜爱的少女",
        "items": [
            "远方的少女之心",
            "少女飘摇的思念",
            "少女苦短的良辰",
            "少女片刻的闲暇",
            "少女易逝的芳颜"
        ],
        "effects": {
            "2": "角色造成的治疗效果提升15%。",
            "4": "施放元素战技或元素爆发后的10秒内，队伍中所有角色受治疗效果加成提高20%。"
        }
    },
    "EchoesOfAnOffering": {
        "setName": "来歆余响",
        "items": [
            "魂香之花",
            "垂玉之叶",
            "祝祀之凭",
            "涌泉之盏",
            "浮溯之珏"
        ],
        "effects": {
            "4": "普通攻击命中敌人时，有36%概率触发「幽谷祝祀」：普通攻击造成的伤害提高，伤害提高值为攻击力的70%，该效果将在普通攻击造成伤害后的0.05秒后清除。普通攻击未触发「幽谷祝祀」时，会使下次触发概率提升20%；0.2秒内至多判定1次触发与否。",
            "2": "攻击力提高18%。"
        }
    },
    "martialArtist": {
        "setName": "武人",
        "items": [
            "武人的红花",
            "武人的羽饰",
            "武人的水漏",
            "武人的酒杯",
            "武人的头巾"
        ],
        "effects": {
            "4": "施放元素战技后的8秒内，普通攻击和重击造成的伤害提升25%。",
            "2": "普通攻击与重击造成的伤害提高15%；"
        }
    },
    "prayersForWisdom": {
        "setName": "祭雷之人",
        "items": [
            "祭雷礼冠"
        ],
        "effects": {
            "1": "受到的雷元素附着效果的持续时间减少40%。"
        }
    },
    "exile": {
        "setName": "流放者",
        "items": [
            "流放者之花",
            "流放者之羽",
            "流放者怀表",
            "流放者之杯",
            "流放者头冠"
        ],
        "effects": {
            "2": "元素充能效率提高20%。",
            "4": "施放元素爆发后，每2秒为队伍中所有角色（不包括自己）恢复2点元素能量。该效果持续6秒，无法叠加。"
        }
    },
    "thunderingFury": {
        "setName": "如雷的盛怒",
        "items": [
            "雷鸟的怜悯",
            "雷灾的孑遗",
            "雷霆的时计",
            "降雷的凶兆",
            "唤雷的头冠"
        ],
        "effects": {
            "4": "超载、感电、超导反应造成的伤害提升40%。触发这些元素反应时，元素战技冷却时间减少1秒。该效果每0.8秒最多触发一次。",
            "2": "获得15%雷元素伤害加成。"
        }
    },
    "prayersForDestiny": {
        "setName": "祭水之人",
        "items": [
            "祭水礼冠"
        ],
        "effects": {
            "1": "受到的水元素附着效果的持续时间减少40%。"
        }
    },
    "crimsonWitch": {
        "setName": "炽烈的炎之魔女",
        "items": [
            "魔女的炎之花",
            "魔女常燃之羽",
            "魔女破灭之时",
            "魔女的心之火",
            "焦灼的魔女帽"
        ],
        "effects": {
            "2": "获得15%火元素伤害加成。",
            "4": "超载、燃烧反应造成的伤害提升40%，蒸发、融化反应的加成系数提高15%。施放元素战技后的10秒内，2件套的效果提高50%，该效果最多叠加3次。"
        }
    },
    "noblesseOblige": {
        "setName": "昔日宗室之仪",
        "items": [
            "宗室之花",
            "宗室之翎",
            "宗室时计",
            "宗室银瓮",
            "宗室面具"
        ],
        "effects": {
            "2": "元素爆发造成的伤害提升20%。",
            "4": "施放元素爆发后，队伍中所有角色攻击力提升20%，持续12秒。该效果不可叠加。"
        }
    },
    "viridescentVenerer": {
        "setName": "翠绿之影",
        "items": [
            "野花记忆的绿野",
            "猎人青翠的箭羽",
            "翠绿猎人的笃定",
            "翠绿猎人的容器",
            "翠绿的猎人之冠"
        ],
        "effects": {
            "2": "获得15%风元素伤害加成。",
            "4": "扩散反应造成的伤害提升60%。根据扩散的元素类型，降低受到影响的敌人40%的对应元素抗性，持续10秒。"
        }
    },
    "luckyDog": {
        "setName": "幸运儿",
        "items": [
            "幸运儿绿花",
            "幸运儿鹰羽",
            "幸运儿沙漏",
            "幸运儿之杯",
            "幸运儿银冠"
        ],
        "effects": {
            "2": "防御力提高100点。",
            "4": "拾取摩拉时，恢复300点生命值。"
        }
    },
    "tinyMiracle": {
        "setName": "奇迹",
        "items": [
            "奇迹之花",
            "奇迹之羽",
            "奇迹之沙",
            "奇迹之杯",
            "奇迹耳坠"
        ],
        "effects": {
            "4": "受到某个元素类型的伤害后，相应的抗性提升30%，持续10秒。该效果每10秒只能触发一次。",
            "2": "所有元素抗性提高20%。"
        }
    }
}
